#### Pandas for Data Analysis
-  Introduction to Pandas
-  Data wrangling and cleaning
##### The objective of this course is to ensure you are able to:
-  Learn basics of Pandas
-  Use pandas for data preprocessing

In [1]:
import pandas as pd
import numpy as np

#### Data Structures in Pandas

Pandas provides 2 types of data structures for handling data
1. Series: One Dimensional integers,strings, python objects
2. DataFrame: 2 Dimensional Data structure

In [4]:
pd.Series([1,3,np.nan,8,10])# ,index=[4,5,6,7,8]

0     1.0
1     3.0
2     NaN
3     8.0
4    10.0
dtype: float64

In [44]:
dates = pd.date_range("20200101",periods=6)

In [46]:
df1 = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list("ABCD"))

In [47]:
df = pd.DataFrame(
    {
        "A": [1.0,-2,3,4],
        "B": pd.Timestamp("20130102"),
        "C": pd.Series([1,2,3,4], index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [48]:
df.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [49]:
df

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1 -2.0 2013-01-02  2.0  3  train  foo
2  3.0 2013-01-02  3.0  3   test  foo
3  4.0 2013-01-02  4.0  3  train  foo

In [50]:
df.index

Index([0, 1, 2, 3], dtype='int64')

In [51]:
df.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [-2.0, Timestamp('2013-01-02 00:00:00'), 2.0, 3, 'train', 'foo'],
       [3.0, Timestamp('2013-01-02 00:00:00'), 3.0, 3, 'test', 'foo'],
       [4.0, Timestamp('2013-01-02 00:00:00'), 4.0, 3, 'train', 'foo']],
      dtype=object)

In [52]:
df.describe()

              A                    B         C    D
count  4.000000                    4  4.000000  4.0
mean   1.500000  2013-01-02 00:00:00  2.500000  3.0
min   -2.000000  2013-01-02 00:00:00  1.000000  3.0
25%    0.250000  2013-01-02 00:00:00  1.750000  3.0
50%    2.000000  2013-01-02 00:00:00  2.500000  3.0
75%    3.250000  2013-01-02 00:00:00  3.250000  3.0
max    4.000000  2013-01-02 00:00:00  4.000000  3.0
std    2.645751                  NaN  1.290994  0.0

In [55]:
df1.T

   2020-01-01  2020-01-02  2020-01-03  2020-01-04  2020-01-05  2020-01-06
A    1.424552    0.647976    1.035451    1.705561   -1.997002    0.222288
B   -0.177332   -0.238706    1.762694    1.349802    0.732437    0.294812
C    1.148161    0.818773   -0.337219   -0.448200    0.249619   -0.041105
D   -1.053534   -0.576164    0.441507   -0.294977    0.745342   -0.332780

In [56]:
df1

                   A         B         C         D
2020-01-01  1.424552 -0.177332  1.148161 -1.053534
2020-01-02  0.647976 -0.238706  0.818773 -0.576164
2020-01-03  1.035451  1.762694 -0.337219  0.441507
2020-01-04  1.705561  1.349802 -0.448200 -0.294977
2020-01-05 -1.997002  0.732437  0.249619  0.745342
2020-01-06  0.222288  0.294812 -0.041105 -0.332780

In [64]:
df1.sort_index(axis=0,ascending=False)

                   A         B         C         D
2020-01-06  0.222288  0.294812 -0.041105 -0.332780
2020-01-05 -1.997002  0.732437  0.249619  0.745342
2020-01-04  1.705561  1.349802 -0.448200 -0.294977
2020-01-03  1.035451  1.762694 -0.337219  0.441507
2020-01-02  0.647976 -0.238706  0.818773 -0.576164
2020-01-01  1.424552 -0.177332  1.148161 -1.053534

In [67]:
df1.sort_values(by="B",ascending=False)

                   A         B         C         D
2020-01-03  1.035451  1.762694 -0.337219  0.441507
2020-01-04  1.705561  1.349802 -0.448200 -0.294977
2020-01-05 -1.997002  0.732437  0.249619  0.745342
2020-01-06  0.222288  0.294812 -0.041105 -0.332780
2020-01-01  1.424552 -0.177332  1.148161 -1.053534
2020-01-02  0.647976 -0.238706  0.818773 -0.576164

In [68]:
df1.at['20200103','B']

1.762693604568515

In [81]:
df1.loc['20200103']

A    1.035451
B    1.762694
C   -0.337219
D    0.441507
Name: 2020-01-03 00:00:00, dtype: float64

In [92]:
df1.iloc[:,:3]

                   A         B         C
2020-01-01  1.424552 -0.177332  1.148161
2020-01-02  0.647976 -0.238706  0.818773
2020-01-03  1.035451  1.762694 -0.337219
2020-01-04  1.705561  1.349802 -0.448200
2020-01-05 -1.997002  0.732437  0.249619
2020-01-06  0.222288  0.294812 -0.041105

In [95]:
df1["20200101":"20200105"]

                   A         B         C         D
2020-01-01  1.424552 -0.177332  1.148161 -1.053534
2020-01-02  0.647976 -0.238706  0.818773 -0.576164
2020-01-03  1.035451  1.762694 -0.337219  0.441507
2020-01-04  1.705561  1.349802 -0.448200 -0.294977
2020-01-05 -1.997002  0.732437  0.249619  0.745342

##### Boolean Indexing

In [98]:
df1[df1.A<1]

                   A         B         C         D
2020-01-02  0.647976 -0.238706  0.818773 -0.576164
2020-01-05 -1.997002  0.732437  0.249619  0.745342
2020-01-06  0.222288  0.294812 -0.041105 -0.332780

In [99]:
df

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1 -2.0 2013-01-02  2.0  3  train  foo
2  3.0 2013-01-02  3.0  3   test  foo
3  4.0 2013-01-02  4.0  3  train  foo

In [100]:
df[df.E.isin(['test'])]

     A          B    C  D     E    F
0  1.0 2013-01-02  1.0  3  test  foo
2  3.0 2013-01-02  3.0  3  test  foo

In [117]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130101", periods=6))

In [120]:
s1

2013-01-01    1
2013-01-02    2
2013-01-03    3
2013-01-04    4
2013-01-05    5
2013-01-06    6
Freq: D, dtype: int64

In [119]:
df1['E']=s1
df1

                   A         B         C         D   E
2020-01-01  1.424552 -0.177332  1.148161 -1.053534 NaN
2020-01-02  0.647976 -0.238706  0.818773 -0.576164 NaN
2020-01-03  1.035451  1.762694 -0.337219  0.441507 NaN
2020-01-04  1.705561  1.349802 -0.448200 -0.294977 NaN
2020-01-05 -1.997002  0.732437  0.249619  0.745342 NaN
2020-01-06  0.222288  0.294812 -0.041105 -0.332780 NaN

In [129]:
df1.agg(lambda x: np.mean(x)*50,axis=1)

2020-01-01    16.773085
2020-01-02     8.148499
2020-01-03    36.280406
2020-01-04    28.902335
2020-01-05    -3.370051
2020-01-06     1.790187
Freq: D, dtype: float64

In [133]:
df1.transform(lambda x: x*10 )

                    A          B          C          D   E
2020-01-01  14.245518  -1.773319  11.481613 -10.535344 NaN
2020-01-02   6.479756  -2.387055   8.187734  -5.761636 NaN
2020-01-03  10.354511  17.626936  -3.372190   4.415068 NaN
2020-01-04  17.055607  13.498025  -4.481995  -2.949768 NaN
2020-01-05 -19.970019   7.324371   2.496185   7.453423 NaN
2020-01-06   2.222876   2.948121  -0.411050  -3.327798 NaN

### Value Counts

In [136]:
s = pd.Series(np.random.randint(0,7,size=10))

In [137]:
s

0    0
1    0
2    5
3    3
4    0
5    6
6    6
7    2
8    0
9    0
dtype: int64

In [138]:
s.value_counts()

0    5
6    2
5    1
3    1
2    1
Name: count, dtype: int64

#### String methods

In [141]:
s = pd.Series(["A","B","C","D",np.nan,"E"])
s.str.lower()

0      a
1      b
2      c
3      d
4    NaN
5      e
dtype: object

#### Merging

In [142]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  0.898290  0.441054 -0.420459 -0.105995
1  2.121722 -1.306041 -2.220577  0.344226
2 -0.050608  0.053938 -0.069738 -0.270806
3 -0.436365  0.247949 -0.260829 -0.309813
4 -0.542473 -0.017690 -0.301434  0.667811
5  0.490035 -1.105588 -1.117578  0.389755
6 -1.141585  1.048810 -0.369860  0.962059
7  1.702287  1.239116  0.763141  1.271124
8  0.370608  0.254877 -0.516023  0.551735
9  1.075615  1.101939 -1.551232 -0.107357

In [148]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.898290  0.441054 -0.420459 -0.105995
 1  2.121722 -1.306041 -2.220577  0.344226
 2 -0.050608  0.053938 -0.069738 -0.270806,
           0         1         2         3
 3 -0.436365  0.247949 -0.260829 -0.309813
 4 -0.542473 -0.017690 -0.301434  0.667811
 5  0.490035 -1.105588 -1.117578  0.389755
 6 -1.141585  1.048810 -0.369860  0.962059,
           0         1         2         3
 7  1.702287  1.239116  0.763141  1.271124
 8  0.370608  0.254877 -0.516023  0.551735
 9  1.075615  1.101939 -1.551232 -0.107357]

In [152]:
pd.concat([df,pd.DataFrame(np.random.randn(1,4))])

          0         1         2         3
0  0.898290  0.441054 -0.420459 -0.105995
1  2.121722 -1.306041 -2.220577  0.344226
2 -0.050608  0.053938 -0.069738 -0.270806
3 -0.436365  0.247949 -0.260829 -0.309813
4 -0.542473 -0.017690 -0.301434  0.667811
5  0.490035 -1.105588 -1.117578  0.389755
6 -1.141585  1.048810 -0.369860  0.962059
7  1.702287  1.239116  0.763141  1.271124
8  0.370608  0.254877 -0.516023  0.551735
9  1.075615  1.101939 -1.551232 -0.107357
0  0.437777  0.350437  0.946168 -0.522727

In [162]:
left = pd.DataFrame({"key": ["foo", "fooo"], "lval": [1, 2]})

In [163]:
right = pd.DataFrame({"key": ["fooo", "foo"], "rval": [4, 5]})

In [164]:
left

    key  lval
0   foo     1
1  fooo     2

In [165]:
right

    key  rval
0  fooo     4
1   foo     5

In [166]:
pd.merge(left,right,on="key")

    key  lval  rval
0   foo     1     5
1  fooo     2     4

In [167]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

In [168]:
df

     A      B         C         D
0  foo    one -1.289133 -0.707020
1  bar    one -1.715069 -0.428377
2  foo    two  0.627588 -0.066245
3  bar  three  0.105470  1.361526
4  foo    two  1.147809  0.312721
5  bar    two -0.560376  0.296423
6  foo    one  0.322941  1.185370
7  foo  three -1.752883 -0.578151

In [172]:
df.groupby(['A','B'])[['C','D']].sum()

                  C         D
A   B
bar one   -1.715069 -0.428377
    three  0.105470  1.361526
    two   -0.560376  0.296423
foo one   -0.966192  0.478349
    three -1.752883 -0.578151
    two    1.775397  0.246476